PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	_bdshot_processed[output_channel] = true;
}

float calculate_rate_hz(uint64_t last_timestamp, float last_rate_hz, uint64_t timestamp)
{
	if (last_timestamp == 0 || timestamp <= last_timestamp) {
		return last_rate_hz;
	}

	uint64_t dt_us = timestamp - last_timestamp;

	float instant_rate = 1000000.0f / dt_us;

	// Simple exponential moving average with fixed alpha
	// Alpha = 0.125 (1/8) works well across all rates
	float rate_hz = instant_rate * 0.125f + last_rate_hz * 0.875f;

	return rate_hz;
}

// Converts captured edge timestamps into a raw bit stream.
// Measures the time intervals between signal edges to determine how many consecutive
// 1s or 0s to shift in, alternating the bit value with each edge transition.
// Uses adaptive per-channel timing calibration to handle ESC oscillator variation.
// Returns a 20 bit raw value that still needs RLL and GCR decoding.
uint32_t convert_edge_intervals_to_bitstream(uint8_t timer_index, uint8_t channel_index)
{
	// First pass: collect all intervals
	uint32_t intervals[CHANNEL_CAPTURE_BUFF_SIZE] = {};
	unsigned interval_count = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[timer_index][channel_index][1];

	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {
		if (dshot_capture_buffer[timer_index][channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		uint32_t interval = dshot_capture_buffer[timer_index][channel_index][i] - previous;

		// Filter out noise: reject intervals <10 or >100 ticks
		if (interval >= 10 && interval <= 100) {
			intervals[interval_count++] = interval;
		}

		previous = dshot_capture_buffer[timer_index][channel_index][i];
	}

	if (interval_count == 0) {
		return 0;
	}

	// Calibrate base interval using minimum interval (always 1 bit in GCR)
	// The shortest valid interval in the frame represents a single bit period
	uint32_t min_interval = intervals[0];

	for (unsigned i = 1; i < interval_count; i++) {
		if (intervals[i] < min_interval) {
			min_interval = intervals[i];
		}
	}

	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);

	if (output_channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	// Update base interval with low-pass filter (alpha = 1/8) using x8 fixed-point
	// base_x8 = base_x8 * 7/8 + min_interval (which is min * 8/8 in x8 representation)
	_base_interval_x8[output_channel] = _base_interval_x8[output_channel] - (_base_interval_x8[output_channel] >> 3) + min_interval;

	// Second pass: decode bits using adaptive threshold (integer math)
	uint32_t value = 0;
	uint32_t high = 1;
	unsigned shifted = 0;

	uint32_t base_x8 = _base_interval_x8[output_channel];

	for (unsigned i = 0; i < interval_count; i++) {
		// Convert interval to bit count: bits = interval/base + 0.5, using x8 fixed-point rounding
		uint32_t bits = (intervals[i] * 8 + base_x8 / 2) / base_x8;

		// Clamp to valid range (1-4 bits typical in GCR encoding)
		if (bits < 1) {
			bits = 1;

		} else if (bits > 4) {
			bits = 4;
		}

		// Shift in the bits
		for (unsigned bit = 0; bit < bits; ++bit) {
			value = (value << 1) | high;
			++shifted;
		}

		high = !high;
	}

	// Flexible frame validation: accept 18-24 bits instead of forcing exactly 21
	// This handles ESC timing variation and incomplete frames
	if (shifted < 18 || shifted > 24) {
		// Frame too short or too long - likely corrupted
		return 0;
	}

	// Pad to 21 bits for GCR decoder (which expects exactly 21 bits)
	if (shifted < 21) {
		value <<= (21 - shifted);

	} else if (shifted > 21) {
		// Trim excess bits (shouldn't happen often with proper decoding)
		value >>= (shifted - 21);
	}

	return value;
}

void decode_dshot_telemetry(uint32_t payload, struct BDShotTelemetry *packet)
{
	// Extended DShot Telemetry
	bool edt_enabled = _edt_enabled;
	uint32_t mantissa = payload & 0x01FF;
	bool is_telemetry = !(mantissa & 0x0100); // if the msb of the mantissa is zero, then this is an extended telemetry packet

	if (edt_enabled && is_telemetry) {
		packet->type = (payload & 0x0F00) >> 8;
		packet->value = payload & 0x00FF; // extended telemetry value is 8 bits wide

	} else {
		// otherwise it's an eRPM frame
		uint8_t exponent = ((payload >> 9) & 0x7); // 3 bit: exponent
		uint16_t period = (payload & 0x1FF); // 9 bit: period base
		period = period << exponent; // Period in usec

		packet->type = DSHOT_EDT_ERPM;

		if (period == 65408 || period == 0) {
			// 65408 is a special case for zero motion (e.g., stationary motor)
			packet->value = 0;

		} else {
			packet->value = (1000000 * 60 / 100 + period / 2) / period;
		}
	}
}

// bits  1-11  - throttle value (0-47 are reserved for commands, 48-2047 give 2000 steps of throttle resolution)
// bit   12    - dshot telemetry enable/disable
// bits  13-16 - XOR checksum
void dshot_motor_data_set(uint8_t channel, uint16_t data, bool telemetry)
{
	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (!channel_initialized) {
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= data << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	// XOR checksum calculation
	csum_data >>= NIBBLES_SIZE;

	for (uint8_t i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bdshot_channel_mask & (1 << channel)) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}

	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer_index];
	uint8_t num_motors = mapping->channel_count_including_gaps;
	uint8_t timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (uint8_t motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		dshot_output_buffer[timer_index][motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}
}

int up_dshot_arm(bool armed)
{
	int ret = PX4_OK;

	for (int timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		io_timer_channel_mode_t mode = timer_configs[timer_index].bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot;
		ret |= io_timer_set_enable(armed, mode, io_timer_get_group(timer_index));
	}

	return ret;
}

