PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
uint16_t up_bdshot_num_channels_ready(void)
{
	uint16_t num_ready = 0;

	for (uint8_t i = 0; i < MAX_TIMER_IO_CHANNELS; ++i) {
		if (_bdshot_processed[i]) {
			++num_ready;
		}
	}

	return num_ready;
}

int up_bdshot_num_errors(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return read_fail_crc[channel];
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	int status = PX4_ERROR;

	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return status;
	}

	uint8_t timer_index = timer_io_channels[channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[channel].timer_channel - 1;
	bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

	if (channel_initialized && _erpms[channel].ready) {
		*erpm = _erpms[channel].erpm;
		status = PX4_OK;
	}

	// Mark sample read — only for channels with capture support
	if (_bdshot_capture_supported[channel]) {
		_bdshot_processed[channel] = false;
	}

	return status;
}

int up_bdshot_get_extended_telemetry(uint8_t channel, int type, uint8_t *value)
{
	int result = PX4_ERROR;

	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return result;
	}

	switch (type) {
	case DSHOT_EDT_TEMPERATURE:
		if (_edt_temp[channel].ready) {
			*value = _edt_temp[channel].value;
			_edt_temp[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_VOLTAGE:
		if (_edt_volt[channel].ready) {
			*value = _edt_volt[channel].value;
			_edt_volt[channel].ready = false;
			result = PX4_OK;
		}

		break;

	case DSHOT_EDT_CURRENT:
		if (_edt_curr[channel].ready) {
			*value = _edt_curr[channel].value;
			_edt_curr[channel].ready = false;
			result = PX4_OK;
		}

		break;

	default:
		break;
	}

	return result;
}

int up_bdshot_channel_online(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return _bdshot_online[channel];
}

int up_bdshot_channel_capture_supported(uint8_t channel)
{
	if (channel >= MAX_TIMER_IO_CHANNELS) {
		return 0;
	}

	return _bdshot_capture_supported[channel];
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats:");

	if (_bdshot_channel_mask) {
		PX4_INFO("BDShot channel mask: 0x%2x", (unsigned)_bdshot_channel_mask);

		// Always show read counters for BDShot
		for (int i = 0; i < MAX_TIMER_IO_CHANNELS; i++) {
			if (_bdshot_channel_mask & (1 << i)) {
				if (_bdshot_capture_supported[i]) {
					PX4_INFO("Ch%u: read_ok %lu, fail_crc %lu",
						 i, read_ok[i], read_fail_crc[i]);

				} else {
					PX4_INFO("Ch%u: no DMA for capture", i);
				}
			}
		}
	}

	if (_edt_enabled) {
		PX4_INFO("BDShot EDT");

		for (int i = 0; i < MAX_TIMER_IO_CHANNELS; i++) {
			if (_bdshot_online[i]) {
				PX4_INFO("Ch%d:  eRPM: %dHz  Temp: %dC (%.1fHz)  Volt: %.2fV (%.1fHz)  Curr: %.1fA (%.1fHz)",
					 i,
					 (int)_erpms[i].rate_hz,
					 (int)_edt_temp[i].value,
					 (double)_edt_temp[i].rate_hz,
					 (double)_edt_volt[i].value * 0.25,
					 (double)_edt_volt[i].rate_hz,
					 (double)_edt_curr[i].value * 0.5,
					 (double)_edt_curr[i].rate_hz);
			}
		}
	}
}

#endif
